---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SurfaceSplit
source: html/04070324-7a37-2dde-0a6c-aded0ca79524.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SurfaceSplit Property

The splitting boundary must split the Surface into exactly two pieces.

## Syntax (C#)
```csharp
public static FailureDefinitionId SurfaceSplit { get; }
```